; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_3 ?v3 - type_1 ?v8 - type_3)
 	      (pred_2 ?v7 - object ?v8 - type_3)
	      (pred_4 ?v3 - type_1 ?v2 - type_2)
	      (pred_1 ?v3 - type_1 ?v7 - object ?v2 - type_2))

   (:action op_2
       :parameters  (?v3 - type_1 ?v1 ?v4 - type_3)
       :precondition (and  (pred_3 ?v3 ?v1))
       :effect (and  (pred_3 ?v3 ?v4)
		     (not (pred_3 ?v3 ?v1))))

   (:action op_1
       :parameters (?v3 - type_1 ?v5 - object ?v6 - type_3 ?v2 - type_2)
       :precondition  (and  (pred_2 ?v5 ?v6) (pred_3 ?v3 ?v6) (pred_4 ?v3 ?v2))
       :effect (and (pred_1 ?v3 ?v5 ?v2)
		    (not (pred_2 ?v5 ?v6)) 
		    (not (pred_4 ?v3 ?v2))))

   (:action op_3
       :parameters (?v3 - type_1 ?v5 - object ?v6 - type_3 ?v2 - type_2)
       :precondition  (and  (pred_1 ?v3 ?v5 ?v2) (pred_3 ?v3 ?v6))
       :effect (and (pred_2 ?v5 ?v6)
		    (pred_4 ?v3 ?v2)
		    (not (pred_1 ?v3 ?v5 ?v2)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_06 obj_02 - type_1
obj_09 obj_05 obj_03 obj_07 - type_3
obj_10 obj_11 obj_12 - type_2
obj_04 obj_01 obj_08 - object)
(:init
(pred_3 obj_06 obj_12)
(pred_4 obj_06 obj_09)
(pred_4 obj_06 obj_05)
(pred_3 obj_02 obj_11)
(pred_4 obj_02 obj_03)
(pred_4 obj_02 obj_07)
(pred_2 obj_04 obj_11)
(pred_2 obj_01 obj_12)
(pred_2 obj_08 obj_12)
)
(:goal
(and
(pred_2 obj_04 obj_12)
(pred_2 obj_01 obj_10)
(pred_2 obj_08 obj_12)
)
)

(:constraints
  (and
    (always (not (and (pred_3 obj_06 obj_12) (pred_3 obj_02 obj_12))))
  )
)
)

; plan
1. (op_1 obj_02 obj_04 obj_11 obj_07)
   deleted: (pred_2 obj_04 obj_11) (pred_4 obj_02 obj_07)
   added: (pred_1 obj_02 obj_04 obj_07)
   goals met: 1 of 3
2. (op_1 obj_06 obj_01 obj_12 obj_05)
   deleted: (pred_2 obj_01 obj_12) (pred_4 obj_06 obj_05)
   added: (pred_1 obj_06 obj_01 obj_05)
   goals met: 1 of 3
3. (op_2 obj_06 obj_12 obj_10)
   deleted: (pred_3 obj_06 obj_12)
   added: (pred_3 obj_06 obj_10)
   goals met: 1 of 3
4. (op_2 obj_02 obj_11 obj_12)
   deleted: (pred_3 obj_02 obj_11)
   added: (pred_3 obj_02 obj_12)
   goals met: 1 of 3
5. (op_3 obj_02 obj_04 obj_12 obj_07)
   deleted: (pred_1 obj_02 obj_04 obj_07)
   added: (pred_2 obj_04 obj_12) (pred_4 obj_02 obj_07)
   goals met: 2 of 3
6. (op_3 obj_06 obj_01 obj_10 obj_05)
   deleted: (pred_1 obj_06 obj_01 obj_05)
   added: (pred_2 obj_01 obj_10) (pred_4 obj_06 obj_05)
   goals met: 3 of 3
